import random
import time

introduction = """Почти е лято! Време за безгрижни разходки, слънчеви дни с приятели и… четене на задължителните книги за ваканцията. 
Голяма част от книгите могат истински да те заинтригуват и да направят лятото ти още по-цветно и вълнуващо. 
Да започваме с четенето. Но първо ни кажи кой клас си? Моля, въведи отговорът си с цифра:"""
print(introduction)
grade = int(input('-> '))
books_first_grade = ['Български народни приказки', 'Ран Босилек - „Патиланско царство“', 'Братя Грим - „Приказки“',
                     'Астрид Линдгрен - „Пипи Дългото чорапче“', 'Езоп - „Басни“', 'Ангел Каралийчев - „Приказен свят“',
                     'Константин Константинов - „Приказки за тебе“']
books_second_grade = ['Ангел Каралийчев - „Тошко Африкански“', 'Валери Петров - „Меко казано“', 'Ран Босилек - „Приказки“',
                      'Емилиян Станев - „През води и гори"', 'Ханс Кристиан Андерсен - „Приказки“', 'Вилхелм и Якоб Грим - „Приказки“',
                      'Жан дьо Лафонтен - „Басни“', 'Астрид Линдгрен - „Емил от Льонеберя“']
books_third_grade = ['Георги Данаилов – “Деца играят вън”', 'Георги Константинов – “Туфо, рижият пират”',
                     'Карло Колоди – „Приключенията на Пинокио”', 'Елин Пелин – “Ян Бибиян”', 'Ерих Кестнер – “Хвърчащата класна стая”',
                     'Даниел Дефо – “Приключенията на Робинзон Крузо”']
books_fourth_grade = ['Легендата „Господ и дяволът правят света“', 'Приказката „Тримата братя и златната ябълка“', 'Приказката „Златното момиче“',
                      'Приказката „Главатарят, който искал да плени месечината“', 'Народната песен „Троица братя града градяха“',
                      'Христо Ботев – „Хайдути“', 'Шарл Перо - „Котаракът в чизми“', 'Х. Кр. Андерсен - „Грозното патенце“',
                      'Рик Риърдън - „Похитителят на мълнии“']
books_fifth_grade = ['Любен Каравелов - „Хубава си моя горо“', 'Иван Вазов – „Под игото“', 'Джералд Даръл – „Моето семейство“',
                     'Елин Пелин – „Косачи“', 'Веселин Ханчев – „Художник“', 'Марк Твен – „Принцът и просякът“',
                     'Христо Смирненски – „Братчетата на Гаврош“', 'Йордан Йовков – „Серафим“',
                     'Антоан дьо Сент-Екзюпери – „Малкият принц“']
books_sixth_grade = ['Добри Чинтулов – „Стани, стани, юнак балкански“', 'Христо Ботев – „На прощаване“',
                    'Иван Вазов – „Една българка“', 'Алеко Константинов – „До Чикаго и назад“',
                    'Пенчо Славейков – „Неразделни“', 'Пейо Яворов – „Заточеници“', 'Елин Пелин – „По жътва“', 'Йордан Йовков – „По жицата“']
books_seventh_grade = ['„Митът за Прометей“', '„Митът за Едип“', 'Омир – „Илиада”', 'Библия', 'Константин Преславски – „Азбучна молитва”',
                       'Черноризец Храбър – „За буквите”', 'Джовани Бокачо – „Декамерон”', 'Мигел де Сервантес – „Дон Кихот”', 'Уилям Шекспир – „Хамлет”']
books_eighth_grade = ['Джонатън Суифт – „Пътешествията на Гъливер“', 'Джордж Байрон – „Дон Жуан“', 'Александър С. Пушкин – „Евгений Онегин“',
                      'Оноре дьо Балзак – „Дядо Горио“', 'Гюстав Флобер – „Мадам Бовари“', 'Шарл Бодлер – „Сплин“', 'Пол Верлен – „Есенна песен“',
                      'Паисий Хиляндарски – „История славянобългарска“', 'Петко Славейков – „Изворът на Белоногата“',
                      'Христо Ботев – „Хаджи Димитър“']
books_ninth_grade = ['Иван Вазов – цикълът „Епопея на забравените“', 'Пенчо П. Славейков – „Cis moll“',
                    'Пейо Яворов – „Две хубави очи“', 'Димчо Дебелянов – „Да се завърнеш…“',
                    'Елин Пелин – „Гераците“', 'Гео Милев – „Септември“', 'Христо Смирненски – „Зимни вечери“', 'Атанас Далчев – „Повест“',
                    'Йордан Йовков – „Албена“', 'Никола Вапцаров – „Писмо“', 'Димитър Димов – романът „Тютюн“',
                    'Николай Хайтов – „Дърво без корен“', 'Йордан Радичков – „Нежната спирала“']
books_tenth_grade = ['Димитър Талев – „Железният светилник”', 'Станислав Стратиев –  „Балкански синдром“',
                     'Иван Вазов – „Новото гробище над Сливница“', 'Никола Вапцаров – „История“',
                     'Йордан Радичков – „Ноев ковчег“', 'Христо Ботев – „До моето първо либе“', 'Елин Пелин – „Андрешко“',
                     'Христо Смирненски – „Приказка за стълбата“', 'Емилиян Станев – „Крадецът на праскови“', 'Пейо Яворов – „Градушка“',
                     'П. П. Славейков – „Спи езерото“']
books_eleventh_grade = ['Христо Смирненски – „Зимни вечери”', 'Гео Милев – „Септември”', 'Елисавта Багряна – „Вечната и святата”',
                        'Атанас Далчев – „Болница”', 'Йордан Йовков – Старопланински легенди”', 'Никола Вапцаров – „Моторни песни”',
                        'Димитър Димов – „Тютюн”']
question_list = ['Заглавие:', 'Автор:', 'Други произведения от този автор:', 'В произведението се разказва за:',
                 'Любимият ми момент от произведението е:', 'Любимият ми герой е..., защото...']
if grade == 1:
    for book in range(len(books_first_grade)):
        current_book = random.choice(books_first_grade)
        print(current_book)
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        books_first_grade.remove(current_book)
        time.sleep(3)
    print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
    answer = input()
    while answer == 'Да':
        added_book = input('Моля, напиши заглавието му: ')
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
        answer = input()
    print("""Браво! Ти създаде твоят електронен читателски дневник! Прекрасен е! Надявам се си се забавлявал много влизайки в чудният
              свят на книгите! Пожелаваме ти едно безгрижно и весело лято! И не забравяй да четеш! :)""")
elif grade == 2:
    for book in range(len(books_second_grade)):
        current_book = random.choice(books_second_grade)
        print(current_book)
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        books_second_grade.remove(current_book)
        time.sleep(3)
    print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
    answer = input()
    while answer == 'Да':
        added_book = input('Моля, напиши заглавието му: ')
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
        answer = input()
    print("""Браво! Ти създаде твоят електронен читателски дневник! Прекрасен е! Надявам се си се забавлявал много влизайки в чудният
              свят на книгите! Пожелаваме ти едно безгрижно и весело лято! И не забравяй да четеш! :)""")
elif grade == 3:
    for book in range(len(books_third_grade)):
        current_book = random.choice(books_third_grade)
        print(current_book)
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        books_third_grade.remove(current_book)
        time.sleep(3)
    print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
    answer = input()
    while answer == 'Да':
        added_book = input('Моля, напиши заглавието му: ')
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
        answer = input()
    print("""Браво! Ти създаде твоят електронен читателски дневник! Прекрасен е! Надявам се си се забавлявал много влизайки в чудният
              свят на книгите! Пожелаваме ти едно безгрижно и весело лято! И не забравяй да четеш! :)""")
elif grade == 4:
    for book in range(len(books_fourth_grade)):
        current_book = random.choice(books_fourth_grade)
        print(current_book)
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        books_fourth_grade.remove(current_book)
        time.sleep(3)
    print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
    answer = input()
    while answer == 'Да':
        added_book = input('Моля, напиши заглавието му: ')
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
        answer = input()
    print("""Браво! Ти създаде твоят електронен читателски дневник! Прекрасен е! Надявам се си се забавлявал много влизайки в чудният
          свят на книгите! Пожелаваме ти едно безгрижно и весело лято! И не забравяй да четеш! :)""")
elif grade == 5:
    for book in range(len(books_fifth_grade)):
        current_book = random.choice(books_fifth_grade)
        print(current_book)
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        books_fifth_grade.remove(current_book)
        time.sleep(3)
    print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
    answer = input()
    while answer == 'Да':
        added_book = input('Моля, напиши заглавието му: ')
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
        answer = input()
    print("""Браво! Ти създаде твоят електронен читателски дневник! Прекрасен е! Надявам се си се забавлявал много влизайки в чудният
          свят на книгите! Пожелаваме ти едно безгрижно и весело лято! И не забравяй да четеш! :)""")
elif grade == 6:
    for book in range(len(books_sixth_grade)):
        current_book = random.choice(books_sixth_grade)
        print(current_book)
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        books_sixth_grade.remove(current_book)
        time.sleep(3)
    print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
    answer = input()
    while answer == 'Да':
        added_book = input('Моля, напиши заглавието му: ')
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
        answer = input()
    print("""Браво! Ти създаде твоят електронен читателски дневник! Прекрасен е! Надявам се си се забавлявал много влизайки в чудният
          свят на книгите! Пожелаваме ти едно безгрижно и весело лято! И не забравяй да четеш! :)""")
elif grade == 7:
    for book in range(len(books_seventh_grade)):
        current_book = random.choice(books_seventh_grade)
        print(current_book)
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        books_seventh_grade.remove(current_book)
        time.sleep(3)
    print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
    answer = input()
    while answer == 'Да':
        added_book = input('Моля, напиши заглавието му: ')
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
        answer = input()
    print("""Браво! Ти създаде твоят електронен читателски дневник! Прекрасен е! Надявам се си се забавлявал много влизайки в чудният
          свят на книгите! Пожелаваме ти едно безгрижно и весело лято! И не забравяй да четеш! :)""")
elif grade == 8:
    for book in range(len(books_eighth_grade)):
        current_book = random.choice(books_eighth_grade)
        print(current_book)
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        books_eighth_grade.remove(current_book)
        time.sleep(3)
    print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
    answer = input()
    while answer == 'Да':
        added_book = input('Моля, напиши заглавието му: ')
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
        answer = input()
    print("""Браво! Ти създаде твоят електронен читателски дневник! Прекрасен е! Надявам се си се забавлявал много влизайки в чудният
          свят на книгите! Пожелаваме ти едно безгрижно и весело лято! И не забравяй да четеш! :)""")
elif grade == 9:
    for book in range(len(books_ninth_grade)):
        current_book = random.choice(books_ninth_grade)
        print(current_book)
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        books_ninth_grade.remove(current_book)
        time.sleep(3)
    print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
    answer = input()
    while answer == 'Да':
        added_book = input('Моля, напиши заглавието му: ')
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
        answer = input()
    print("""Браво! Ти създаде твоят електронен читателски дневник! Прекрасен е! Надявам се си се забавлявал много влизайки в чудният
          свят на книгите! Пожелаваме ти едно безгрижно и весело лято! И не забравяй да четеш! :)""")
elif grade == 10:
    for book in range(len(books_tenth_grade)):
        current_book = random.choice(books_tenth_grade)
        print(current_book)
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        books_tenth_grade.remove(current_book)
        time.sleep(3)
    print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
    answer = input()
    while answer == 'Да':
        added_book = input('Моля, напиши заглавието му: ')
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
        answer = input()
    print("""Браво! Ти създаде твоят електронен читателски дневник! Прекрасен е! Надявам се си се забавлявал много влизайки в чудният
          свят на книгите! Пожелаваме ти едно безгрижно и весело лято! И не забравяй да четеш! :)""")
elif grade == 11:
    for book in range(len(books_eleventh_grade)):
        current_book = random.choice(books_eleventh_grade)
        print(current_book)
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        books_eleventh_grade.remove(current_book)
        time.sleep(3)
    print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
    answer = input()
    while answer == 'Да':
        added_book = input('Моля, напиши заглавието му: ')
        print('След като прочете това произведение, моля отговори на следните въпроси за да попълнеш твоят читателски дневник:')
        for i in range(len(question_list)):
            print(question_list[i])
            answer = input()
        print('Искаш ли да добавиш друго произведение към този списък? Моля, отговори с "Да" или "Не"')
        answer = input()
    print("""Браво! Ти създаде твоят електронен читателски дневник! Прекрасен е! Надявам се си се забавлявал много влизайки в чудният
          свят на книгите! Пожелаваме ти едно безгрижно и весело лято! И не забравяй да четеш! :)""")
